In [1]:
# importing the required libraries
import numpy as np # Note that pandas is built on the top of numpy
import pandas as pd

In [3]:
# creating a series (1-d)

a = pd.Series([1,2,3])
print(a)

0    1
1    2
2    3
dtype: int64

In [6]:
b = pd.Series([1,2,3],index=['x','y','z'])
print(b)

x    1
y    2
z    3
dtype: int64

In [7]:
# another way of creating series

c = np.array([7,8,9])
d = pd.Series(c)
print(d)

0    7
1    8
2    9
dtype: int32

In [8]:
# creating an empty series

a = pd.Series()
print(a)

Series([], dtype: float64)

<ipython-input-8-5d440b542ddc>:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a = pd.Series()

In [9]:
e = pd.Series(list('534')) # creating series from list 
print(e)

0    5
1    3
2    4
dtype: object

In [11]:
f = pd.Series(tuple('534')) # creating series from tuple
print(f)

0    5
1    3
2    4
dtype: object

In [13]:
print(f[2]) # printing the third element in series 'f'
print(f[0]) # printing the first element in series 'f'

4
5

In [14]:
f[1] = 10 # changing the second element in seried 'f'
print(f)

0     5
1    10
2     4
dtype: object

In [17]:
# creating series from dictionary

a = {1:"a",2:"b",3:"c"} # We have created a dictionary
b = pd.Series(a)
b

1    a
2    b
3    c
dtype: object

In [16]:
g = {1:"a",2:"b",3:"c"} # We have created a dictionary
h = pd.Series(g,index=[1,3,2]) # We can give the index explicitly
h

1    a
3    c
2    b
dtype: object

In [18]:
# creating series from scaler

a=pd.Series(5,index=[0,1,2])
a

0    5
1    5
2    5
dtype: int64

In [19]:
a=pd.Series([11,22,33,44,55])
print(a)

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [20]:
print(a[0]) #retrieve the first element

11

In [21]:
print(a[:2]) # retrive the first 2 elements

0    11
1    22
dtype: int64

In [22]:
print(a[2:4]) # retrive 3rd and 4th elements

2    33
3    44
dtype: int64

In [23]:
print(a[-3:-1]) # retrive 3rd and 4th elements Note: items are retrived from last

2    33
3    44
dtype: int64

In [24]:
print(a[-3:])  # retrive elements from 3rd element from last

2    33
3    44
4    55
dtype: int64

In [25]:
# retreving data from index
z=pd.Series([22,33,44,54,34],index=['aa','bb','cc','dd','ee'])
z

print(z['aa']) # Retrive the element at the index 'aa'

22

In [26]:
print(z[['aa','bb']]) # Retrive the elemet at index 'aa' and 'bb'
                      # print(z['ff']) # If a label is not contained, an exception is raised.

aa    22
bb    33
dtype: int64

In [27]:
# creating a dataframe (2-d)

'''A pandas DataFrame can be created using various inputs like:
    
    1.Lists
    2.dict
    3.Series
    4.Numpy ndarrays
    5.Another DataFrame

'''

'A pandas DataFrame can be created using various inputs like:\n    \n    1.Lists\n    2.dict\n    3.Series\n    4.Numpy ndarrays\n    5.Another DataFrame\n\n'

In [28]:
# Create an empty dataframe
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [29]:
# Creating dataframe from list

df=pd.DataFrame([["CSE501","A. RAMU",21],["CSE502","B. RAJESH",22],["CSE503","B.SUBBU",23]],columns=["Roll No","Name","Age"])
df

  Roll No       Name  Age
0  CSE501    A. RAMU   21
1  CSE502  B. RAJESH   22
2  CSE503    B.SUBBU   23

In [30]:
# We can specify the datatype too
df=pd.DataFrame([["CSE501","A. RAMU",21],["CSE502","B. RAJESH",22],["CSE503","B.SUBBU",23]],columns=["Roll No","Name","Age"],dtype=float)
df

  Roll No       Name   Age
0  CSE501    A. RAMU  21.0
1  CSE502  B. RAJESH  22.0
2  CSE503    B.SUBBU  23.0

In [33]:
# Creating dataframe from dictionaries

df=pd.DataFrame({"Roll No":["1","2","3"],"Name":["A.RAMU","B.RAJESH","B.SUBBU"]})
df

  Roll No      Name
0       1    A.RAMU
1       2  B.RAJESH
2       3   B.SUBBU

In [36]:
df=pd.DataFrame({"Roll No":["11","22","33"],"Name":["A.RAMU","B.RAJESH","B.SUBBU"]},index=[1,2,3])
df

  Roll No      Name
1      11    A.RAMU
2      22  B.RAJESH
3      33   B.SUBBU

In [37]:
# creating a dataframe from dictionary of series

df=pd.DataFrame({"roll No": pd.Series(["CSE501","CSE502","CSE503"]),"Name":pd.Series(["A.RAMU","B.RAJESH","B.SUBBU"])})
df

  roll No      Name
0  CSE501    A.RAMU
1  CSE502  B.RAJESH
2  CSE503   B.SUBBU

In [39]:
df["roll No"] # selecting a column

0    CSE501
1    CSE502
2    CSE503
Name: roll No, dtype: object

In [40]:
# adding a column to a dataframe

df["Marks"]=pd.Series([100,99,95])
df

  roll No      Name  Marks
0  CSE501    A.RAMU    100
1  CSE502  B.RAJESH     99
2  CSE503   B.SUBBU     95

In [41]:
# deleting a column from a dataframe

del df["Name"]
df

  roll No  Marks
0  CSE501    100
1  CSE502     99
2  CSE503     95

In [42]:
# Row selection by label

# Create a dataframe
df=pd.DataFrame({"roll no":["cse501","cse502","cse503"],"Name":["A.RAMU","B.RAJESH","B.SUBBU"],"Marks":[100,99,95]})
df

  roll no      Name  Marks
0  cse501    A.RAMU    100
1  cse502  B.RAJESH     99
2  cse503   B.SUBBU     95

In [43]:
df.loc[1] # 2nd row is selected

roll no      cse502
Name       B.RAJESH
Marks            99
Name: 1, dtype: object

In [44]:
# We can even select multiple rows.
df.loc[0:1] #Select 1st and 2nd row

  roll no      Name  Marks
0  cse501    A.RAMU    100
1  cse502  B.RAJESH     99

In [45]:
# Adding rows to a dataframe

# Create a dataframe
df=pd.DataFrame({"roll no":["cse501","cse502","cse503"],"Name":["A.RAMU","B.RAMYA","B.SUBBU"],"Marks":[100,99,95]},index=[1,2,3])
df

  roll no     Name  Marks
1  cse501   A.RAMU    100
2  cse502  B.RAMYA     99
3  cse503  B.SUBBU     95

In [46]:
df1=pd.DataFrame({"roll no":["cse504"],"Name":["R.SURESH"],"Marks":[89]},index=[4])
df1

  roll no      Name  Marks
4  cse504  R.SURESH     89

In [47]:
df=df.append(df1)
df

  roll no      Name  Marks
1  cse501    A.RAMU    100
2  cse502   B.RAMYA     99
3  cse503   B.SUBBU     95
4  cse504  R.SURESH     89

In [48]:
# deleting rows from a dataframe

#  Create a dataframe
df=pd.DataFrame({"roll no":["cse501","cse502","cse503"],"Name":["A.RAMU","B.RAMYA","B.SUBBU"],"Marks":[100,99,95]})
df

  roll no     Name  Marks
0  cse501   A.RAMU    100
1  cse502  B.RAMYA     99
2  cse503  B.SUBBU     95

In [49]:
df.drop(0) # First row is deleted

  roll no     Name  Marks
1  cse502  B.RAMYA     99
2  cse503  B.SUBBU     95

In [50]:
# transpose of a dataframe

#  Create a dataframe
df=pd.DataFrame({"roll no":["cse501","cse502","cse503"],"Name":["A.RAMU","B.RAMYA","B.SUBBU"],"Marks":[100,99,95]})
df

  roll no     Name  Marks
0  cse501   A.RAMU    100
1  cse502  B.RAMYA     99
2  cse503  B.SUBBU     95

In [51]:
df.T

              0        1        2
roll no  cse501   cse502   cse503
Name     A.RAMU  B.RAMYA  B.SUBBU
Marks       100       99       95

In [52]:
#  Create a dataframe
df=pd.DataFrame({"roll no":["cse501","cse502","cse503"],"Name":["A.RAMU","B.RAMYA","B.SUBBU"],"Marks":[100,99,95]})
df

  roll no     Name  Marks
0  cse501   A.RAMU    100
1  cse502  B.RAMYA     99
2  cse503  B.SUBBU     95

In [53]:
df.axes # Returns the list of row axis labels and column axis labels.

[RangeIndex(start=0, stop=3, step=1),
 Index(['roll no', 'Name', 'Marks'], dtype='object')]

In [54]:
df.dtypes # Returns the data type of each column.

roll no    object
Name       object
Marks       int64
dtype: object

In [55]:
df.ndim # Returns the number of dimensions of the object. By definition, DataFrame is a 2D object.

2

In [56]:
df.shape # Returns a tuple representing the dimensionality of the DataFrame. Tuple (a,b), where a represents the number of rows and b represents the number of columns.

(3, 3)

In [57]:
df.size # Returns the number of elements in the DataFrame.

9

In [58]:
df.values # Returns the actual data in the DataFrame as an NDarray.

array([['cse501', 'A.RAMU', 100],
       ['cse502', 'B.RAMYA', 99],
       ['cse503', 'B.SUBBU', 95]], dtype=object)

In [59]:
df.head() # returns first five rows if eligible

  roll no     Name  Marks
0  cse501   A.RAMU    100
1  cse502  B.RAMYA     99
2  cse503  B.SUBBU     95

In [60]:
df.head(2) # returns first two rows

  roll no     Name  Marks
0  cse501   A.RAMU    100
1  cse502  B.RAMYA     99

In [61]:
df.tail() # returns last five rows if eligible

  roll no     Name  Marks
0  cse501   A.RAMU    100
1  cse502  B.RAMYA     99
2  cse503  B.SUBBU     95

In [62]:
df.tail(2) # returns last two rows

  roll no     Name  Marks
1  cse502  B.RAMYA     99
2  cse503  B.SUBBU     95

In [63]:
# Descriptive statistics in pandas-python

In [64]:
#  Create a dataframe
df=pd.DataFrame({"roll no":["cse501","cse502","cse503"],"Name":["A.RAMU","B.RAMYA","B.SUBBU"],"Marks":[100,99,95]})
df

  roll no     Name  Marks
0  cse501   A.RAMU    100
1  cse502  B.RAMYA     99
2  cse503  B.SUBBU     95

In [65]:
df.sum() # Calculate the sum column wise

roll no      cse501cse502cse503
Name       A.RAMUB.RAMYAB.SUBBU
Marks                       294
dtype: object

In [66]:
df["Marks"].sum() # Calculate sum of a particular column

294

In [67]:
df.count() # Count the number of entries in each column

roll no    3
Name       3
Marks      3
dtype: int64

In [68]:
df.mean() # Calculate the mean. Note the column contain numbers

Marks    98.0
dtype: float64

In [69]:
df.median() # Calculate the median. Note the column contain numbers

Marks    99.0
dtype: float64

In [70]:
df.std() # Calculate the standard deviation. Note the column contain numbers

Marks    2.645751
dtype: float64

In [71]:
df.mode() # Calculate the standard deviation. Note the column contain numbers

  roll no     Name  Marks
0  cse501   A.RAMU     95
1  cse502  B.RAMYA     99
2  cse503  B.SUBBU    100

In [72]:
df["Marks"].min() # Calculate the minimum element in a column

95

In [73]:
df["Marks"].max() # Calculate the maximum element in a column

100

In [74]:
df["Marks"].cumsum() # Calculate the cumulative sum element in a column

0    100
1    199
2    294
Name: Marks, dtype: int64

In [75]:
df["Marks"].cumprod() # Calculate the cumulative product element in a column

0       100
1      9900
2    940500
Name: Marks, dtype: int64

In [76]:
df.describe() #it computes a summary of statistics pertaining to the DataFrame columns. Note that only numeric columns are considered

            Marks
count    3.000000
mean    98.000000
std      2.645751
min     95.000000
25%     97.000000
50%     99.000000
75%     99.500000
max    100.000000

In [77]:
df.describe(include="all")

       roll no    Name       Marks
count        3       3    3.000000
unique       3       3         NaN
top     cse502  A.RAMU         NaN
freq         1       1         NaN
mean       NaN     NaN   98.000000
std        NaN     NaN    2.645751
min        NaN     NaN   95.000000
25%        NaN     NaN   97.000000
50%        NaN     NaN   99.000000
75%        NaN     NaN   99.500000
max        NaN     NaN  100.000000

In [205]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Team    12 non-null     object
 1   Rank    12 non-null     int64
 2   Year    12 non-null     int64
 3   Points  12 non-null     int64
dtypes: int64(3), object(1)
memory usage: 512.0+ bytes

In [78]:
# Python Pandas - Function Application

In [79]:
# Create a user defined function
def math_fun(x):
    return(x**2)

In [80]:
# Create a dataframe
df= pd.DataFrame({"age":[19,20,21,21,23,25],"Height":[165,163,170,176,175,150],"weight":[70,65,66,59,65,70]})
df

   age  Height  weight
0   19     165      70
1   20     163      65
2   21     170      66
3   21     176      59
4   23     175      65
5   25     150      70

In [81]:
# Here we have applied user defined function "math_fun"
df.apply(math_fun)

   age  Height  weight
0  361   27225    4900
1  400   26569    4225
2  441   28900    4356
3  441   30976    3481
4  529   30625    4225
5  625   22500    4900

In [82]:
# axis 0 means column and axis 1 means row. Default is axis 0
df.apply(np.sum,axis=0) # Here we are appling "numpy.sum" function on the dataframe

age       129
Height    999
weight    395
dtype: int64

In [83]:
df.apply(np.sum,axis=1)

0    254
1    248
2    257
3    256
4    263
5    245
dtype: int64

In [ ]:
# <---------->

In [101]:
# calculating the mean,median and mode from statistics

from statistics import mean,median,mode,variance
print("Mean:",mean([1,2,3,4,5]))
print("Median:",median([1,2,3,4,5]))
print("Mode:",mode([1,2,2,4,5]))
print("Variance:",variance([1,2,3]))

Mean: 3
Median: 3
Mode: 2
Variance: 1

In [ ]:
# <---------->

In [95]:
# Reindexing

In [96]:
# Create a dataframe.
df1 = pd.DataFrame(np.random.randn(10,3),columns=['col1','col2','col3']) # Using np.random.randn(10,3), we create 10*3 array of random numbers
df1

       col1      col2      col3
0 -0.599973  0.537283  1.135352
1  0.396166 -0.601489 -2.084858
2 -1.685315 -0.000033  3.749767
3  1.500854 -0.571807  1.139016
4  0.366675 -0.540441  0.182157
5  1.139434  1.124744 -0.068005
6  2.232254  1.377314 -0.192945
7 -0.086785  1.096345  1.074258
8  0.375402 -1.108328 -0.823865
9 -0.156941  0.451704 -0.926363

In [97]:
# Create another dataframe
df2 = pd.DataFrame(np.random.randn(7,3),columns=['col1','col2','col3']) # Here we create a array of 7*3 random numbers
df2

       col1      col2      col3
0  0.000534  1.520928  0.258568
1  0.034001  3.743279 -0.612845
2  1.743284 -0.770376  0.313546
3 -0.378406  1.424070  0.094247
4  0.280798 -1.078279 -1.791873
5 -1.140885  1.181977  0.876396
6  0.311719 -2.347193  0.884588

In [99]:
df1 = df1.reindex_like(df2) # Now we are reindexing df1. It should look like df2
print (df1)                 # First 7 rows of df1 are printed since df2 contains only 7 rows

       col1      col2      col3
0 -0.599973  0.537283  1.135352
1  0.396166 -0.601489 -2.084858
2 -1.685315 -0.000033  3.749767
3  1.500854 -0.571807  1.139016
4  0.366675 -0.540441  0.182157
5  1.139434  1.124744 -0.068005
6  2.232254  1.377314 -0.192945

In [103]:
# Renaming
'''
The rename() method allows you to relabel an axis based on some mapping (a dict or Series) or an arbitrary function.
'''

'\nThe rename() method allows you to relabel an axis based on some mapping (a dict or Series) or an arbitrary function.\n'

In [102]:
# Create a dataframe
df= pd.DataFrame({"age":[19,20,21,21,23,25],"Height":[165,163,170,176,175,150],"weight":[70,65,66,59,65,70]})
df

   age  Height  weight
0   19     165      70
1   20     163      65
2   21     170      66
3   21     176      59
4   23     175      65
5   25     150      70

In [104]:
# We can change the name of columns
df=df.rename(columns={"age":"Student Age","Height":"Student Height","weight":"Student Weight"}) 
df

# We can change the row indexes in the similar way

   Student Age  Student Height  Student Weight
0           19             165              70
1           20             163              65
2           21             170              66
3           21             176              59
4           23             175              65
5           25             150              70

In [106]:
# Iteration

'''
The behavior of basic iteration over Pandas objects depends on the type. When iterating over a Series, it is regarded as array-like, and basic iteration produces the values. Other data structures, like DataFrame follow the dict-like convention of iterating over the keys of the objects.

In short, basic iteration (for i in object) produces :

    1.Series − values
    2.DataFrame − column labels
'''

'\nThe behavior of basic iteration over Pandas objects depends on the type. When iterating over a Series, it is regarded as array-like, and basic iteration produces the values. Other data structures, like DataFrame follow the dict-like convention of iterating over the keys of the objects.\n\nIn short, basic iteration (for i in object) produces :\n\n    1.Series − values\n    2.DataFrame − column labels\n'

In [107]:
# Iterating a data frame

'''
Iterating a DataFrame gives column names.
'''

'\nIterating a DataFrame gives column names.\n'

In [108]:
#Consider a dataframe
df= pd.DataFrame({"age":[19,20,21,21,23,25],"Height":[165,163,170,176,175,150],"weight":[70,65,66,59,65,70]})
df

   age  Height  weight
0   19     165      70
1   20     163      65
2   21     170      66
3   21     176      59
4   23     175      65
5   25     150      70

In [109]:
for i in df:
    print(i)

age
Height
weight

In [110]:
''' To iterate over the rows of the DataFrame, we can use the following functions :

    1.iteritems() − to iterate over the (key,value) pairs
    2.iterrows() − iterate over the rows as (index,series) pairs
    3.itertuples() − iterate over the rows as namedtuples
'''

' To iterate over the rows of the DataFrame, we can use the following functions :\n\n    1.iteritems() − to iterate over the (key,value) pairs\n    2.iterrows() − iterate over the rows as (index,series) pairs\n    3.itertuples() − iterate over the rows as namedtuples\n'

In [112]:
# iteritems()

'''
Iterates over each column as key, value pair with label as key and column value as a Series object.
'''

'\nIterates over each column as key, value pair with label as key and column value as a Series object.\n'

In [113]:
#Consider a dataframe
df= pd.DataFrame({"age":[19,20,21,21,23,25],"Height":[165,163,170,176,175,150],"weight":[70,65,66,59,65,70]})
df

   age  Height  weight
0   19     165      70
1   20     163      65
2   21     170      66
3   21     176      59
4   23     175      65
5   25     150      70

In [114]:
for i,j in df.iteritems():
    print("\n") # For proper spacing
    print(i,j)

age 0    19
1    20
2    21
3    21
4    23
5    25
Name: age, dtype: int64


Height 0    165
1    163
2    170
3    176
4    175
5    150
Name: Height, dtype: int64


weight 0    70
1    65
2    66
3    59
4    65
5    70
Name: weight, dtype: int64

In [115]:
# iterrows()

'''
iterrows() returns the iterator yielding each index value along with a series containing the data in each row.
'''

'\niterrows() returns the iterator yielding each index value along with a series containing the data in each row.\n'

In [116]:
#Consider a dataframe
df= pd.DataFrame({"age":[19,20,21,21,23,25],"Height":[165,163,170,176,175,150],"weight":[70,65,66,59,65,70]})
df

   age  Height  weight
0   19     165      70
1   20     163      65
2   21     170      66
3   21     176      59
4   23     175      65
5   25     150      70

In [117]:
for i,j in df.iterrows():
    print("\n") # For proper spacing
    print(i,j)

0 age        19
Height    165
weight     70
Name: 0, dtype: int64


1 age        20
Height    163
weight     65
Name: 1, dtype: int64


2 age        21
Height    170
weight     66
Name: 2, dtype: int64


3 age        21
Height    176
weight     59
Name: 3, dtype: int64


4 age        23
Height    175
weight     65
Name: 4, dtype: int64


5 age        25
Height    150
weight     70
Name: 5, dtype: int64

In [118]:
# itertuples()

'''
itertuples() method will return an iterator yielding a named tuple for each row in the DataFrame. The first element of the tuple will be the row’s corresponding index value, while the remaining values are the row values.
'''

'\nitertuples() method will return an iterator yielding a named tuple for each row in the DataFrame. The first element of the tuple will be the row’s corresponding index value, while the remaining values are the row values.\n'

In [119]:
#Consider a dataframe
df= pd.DataFrame({"age":[19,20,21,21,23,25],"Height":[165,163,170,176,175,150],"weight":[70,65,66,59,65,70]})
df

   age  Height  weight
0   19     165      70
1   20     163      65
2   21     170      66
3   21     176      59
4   23     175      65
5   25     150      70

In [120]:
for i in df.itertuples():
    print(i)

Pandas(Index=0, age=19, Height=165, weight=70)
Pandas(Index=1, age=20, Height=163, weight=65)
Pandas(Index=2, age=21, Height=170, weight=66)
Pandas(Index=3, age=21, Height=176, weight=59)
Pandas(Index=4, age=23, Height=175, weight=65)
Pandas(Index=5, age=25, Height=150, weight=70)

In [121]:
# Sorting

In [122]:
# Sort by value-Only one column

'''
sort_values() is the method for sorting by values. It accepts a 'by' argument which will use the column name of the DataFrame with which the values are to be sorted.
'''

"\nsort_values() is the method for sorting by values. It accepts a 'by' argument which will use the column name of the DataFrame with which the values are to be sorted.\n"

In [123]:
#Consider a dataframe
df= pd.DataFrame({"age":[19,20,21,21,23,25],"Height":[165,163,170,176,175,150],"weight":[70,65,66,59,65,70]})
df

   age  Height  weight
0   19     165      70
1   20     163      65
2   21     170      66
3   21     176      59
4   23     175      65
5   25     150      70

In [124]:
df.sort_values(by="Height",ascending=False) # default is ascending=True

   age  Height  weight
3   21     176      59
4   23     175      65
2   21     170      66
0   19     165      70
1   20     163      65
5   25     150      70

In [125]:
# Sort by index

'''
Using the sort_index() method, by passing the axis arguments and the order of sorting, DataFrame can be sorted. By default, sorting is done on row labels in ascending order.
'''

'\nUsing the sort_index() method, by passing the axis arguments and the order of sorting, DataFrame can be sorted. By default, sorting is done on row labels in ascending order.\n'

In [126]:
# Consider a dataframe
df= pd.DataFrame({"age":[19,20,21,21,23,25],"Height":[165,163,170,176,175,150],"weight":[70,65,66,59,65,70]})
df

   age  Height  weight
0   19     165      70
1   20     163      65
2   21     170      66
3   21     176      59
4   23     175      65
5   25     150      70

In [127]:
df.sort_index()

   age  Height  weight
0   19     165      70
1   20     163      65
2   21     170      66
3   21     176      59
4   23     175      65
5   25     150      70

In [128]:
# Python Pandas - Indexing and Selecting Data

In [129]:
'''
Pandas supports 2 types of Multi-axes indexing; the three types are mentioned in the following table −

    .loc() :Label based
    .iloc() :Integer based
    
'''

'\nPandas supports 2 types of Multi-axes indexing; the three types are mentioned in the following table −\n\n    .loc() :Label based\n    .iloc() :Integer based\n    \n'

In [130]:
df= pd.DataFrame({"age":[19,20,21,21,23,25],"Height":[165,163,170,176,175,150],"weight":[70,65,66,59,65,70]})
df

   age  Height  weight
0   19     165      70
1   20     163      65
2   21     170      66
3   21     176      59
4   23     175      65
5   25     150      70

In [131]:
df.loc[2] # returns 2nd row

age        21
Height    170
weight     66
Name: 2, dtype: int64

In [132]:
df.loc[2:5] # returns 2nd,3rd,4th,5th row.

   age  Height  weight
2   21     170      66
3   21     176      59
4   23     175      65
5   25     150      70

In [133]:
df.loc[:,"age"] # returns age column

0    19
1    20
2    21
3    21
4    23
5    25
Name: age, dtype: int64

In [134]:
df.loc[[2,5],["age","Height"]] # returns age and height from 2nd and 5th rows

   age  Height
2   21     170
5   25     150

In [135]:
'''
.iloc()
Pandas provide various methods in order to get purely integer based indexing. Like python and numpy, these are 0-based indexing.
'''

'\n.iloc()\nPandas provide various methods in order to get purely integer based indexing. Like python and numpy, these are 0-based indexing.\n'

In [136]:
df.iloc[2:5] # returns 2nd,3rd,4th row

   age  Height  weight
2   21     170      66
3   21     176      59
4   23     175      65

In [137]:
df.iloc[:3] # returns first 3 rows

   age  Height  weight
0   19     165      70
1   20     163      65
2   21     170      66

In [138]:
df.iloc[1:4,0:2] # returns 1st,2nd and 3rd row from age and height

   age  Height
1   20     163
2   21     170
3   21     176

In [139]:
df.iloc[:,2] # returns 2nd column

0    70
1    65
2    66
3    59
4    65
5    70
Name: weight, dtype: int64

In [140]:
df.iloc[2,:] # returns 2nd row

age        21
Height    170
weight     66
Name: 2, dtype: int64

In [141]:
df.iloc[2,2] # returns element at 2nd row 2nd column

66

In [142]:
# Handiling missing values (Dealing with NA)

In [143]:
# Finding for NA'S

In [144]:
# Create a dataframe
df= pd.DataFrame({"age":[19,20,21,21,23,25,23],"Height":[165,163,170,176,175,150,np.nan],"weight":[70,65,66,59,65,70,71]})
df

   age  Height  weight
0   19   165.0      70
1   20   163.0      65
2   21   170.0      66
3   21   176.0      59
4   23   175.0      65
5   25   150.0      70
6   23     NaN      71

In [145]:
df.isna() # to find for NA's in a dataframe

     age  Height  weight
0  False   False   False
1  False   False   False
2  False   False   False
3  False   False   False
4  False   False   False
5  False   False   False
6  False    True   False

In [149]:
df.isna

<bound method DataFrame.isna of    age  Height  weight
0   19   165.0      70
1   20   163.0      65
2   21   170.0      66
3   21   176.0      59
4   23   175.0      65
5   25   150.0      70
6   23     NaN      71>

In [150]:
# Summing is done by considering NA's as zero

df["Height"].sum() # When summing data, NA(NaN) will be treated as Zero

999.0

In [151]:
# Fill NA's with zero

In [152]:
df.fillna(0) # Fill NA (missing values) with zero

   age  Height  weight
0   19   165.0      70
1   20   163.0      65
2   21   170.0      66
3   21   176.0      59
4   23   175.0      65
5   25   150.0      70
6   23     0.0      71

In [153]:
# Fill NA's with previous value

In [154]:
# Create a dataframe
df= pd.DataFrame({"age":[19,20,21,21,23,25,23],"Height":[165,163,170,176,175,150,np.nan],"weight":[70,65,66,59,65,70,71]})
df

   age  Height  weight
0   19   165.0      70
1   20   163.0      65
2   21   170.0      66
3   21   176.0      59
4   23   175.0      65
5   25   150.0      70
6   23     NaN      71

In [155]:
df.fillna(method='pad') # Fill NA with previous value

   age  Height  weight
0   19   165.0      70
1   20   163.0      65
2   21   170.0      66
3   21   176.0      59
4   23   175.0      65
5   25   150.0      70
6   23   150.0      71

In [156]:
# Fill NA's with next values

In [157]:
df= pd.DataFrame({"age":[19,20,21,21,23,25,23],"Height":[165,163,170,np.nan,175,150,np.nan],"weight":[70,65,66,59,65,70,71]})
df

   age  Height  weight
0   19   165.0      70
1   20   163.0      65
2   21   170.0      66
3   21     NaN      59
4   23   175.0      65
5   25   150.0      70
6   23     NaN      71

In [158]:
df.fillna(method ='bfill') # Fill NA with next value

   age  Height  weight
0   19   165.0      70
1   20   163.0      65
2   21   170.0      66
3   21   175.0      59
4   23   175.0      65
5   25   150.0      70
6   23     NaN      71

In [159]:
# NAN - Not a number

In [160]:
# Fill NA's with a constant/text

In [161]:
df= pd.DataFrame({"age":[19,20,21,21,23,25,23],"Height":[165,163,170,np.nan,175,150,np.nan],"weight":[70,65,66,59,65,70,71]})
df

   age  Height  weight
0   19   165.0      70
1   20   163.0      65
2   21   170.0      66
3   21     NaN      59
4   23   175.0      65
5   25   150.0      70
6   23     NaN      71

In [162]:
df.fillna("Not available",inplace=True) # Note: this will modify any other views on this object
df

   age         Height  weight
0   19            165      70
1   20            163      65
2   21            170      66
3   21  Not available      59
4   23            175      65
5   25            150      70
6   23  Not available      71

In [163]:
df # NaN is permanently changed

   age         Height  weight
0   19            165      70
1   20            163      65
2   21            170      66
3   21  Not available      59
4   23            175      65
5   25            150      70
6   23  Not available      71

In [164]:
# Fill NA's with a constant value using replace function

In [165]:
df= pd.DataFrame({"age":[19,20,21,21,23,25,23],"Height":[165,163,170,np.nan,175,150,np.nan],"weight":[70,65,66,59,65,70,71]})
df

   age  Height  weight
0   19   165.0      70
1   20   163.0      65
2   21   170.0      66
3   21     NaN      59
4   23   175.0      65
5   25   150.0      70
6   23     NaN      71

In [166]:
# Replace "NA" using replace function with a constant
df.replace(to_replace=np.nan,value=165)

   age  Height  weight
0   19   165.0      70
1   20   163.0      65
2   21   170.0      66
3   21   165.0      59
4   23   175.0      65
5   25   150.0      70
6   23   165.0      71

In [167]:
# Use interpolate function to fill the missing values

In [168]:
# Create a dataframe
df= pd.DataFrame({"age":[19,20,np.nan,22,23,25,23],"Height":[165,163,170,np.nan,175,150,155],"weight":[70,65,66,np.nan,65,70,71]})
df

    age  Height  weight
0  19.0   165.0    70.0
1  20.0   163.0    65.0
2   NaN   170.0    66.0
3  22.0     NaN     NaN
4  23.0   175.0    65.0
5  25.0   150.0    70.0
6  23.0   155.0    71.0

In [169]:
df.interpolate(method="linear") #‘linear’: ignore the index and treat the values as equally spaced. default

    age  Height  weight
0  19.0   165.0    70.0
1  20.0   163.0    65.0
2  21.0   170.0    66.0
3  22.0   172.5    65.5
4  23.0   175.0    65.0
5  25.0   150.0    70.0
6  23.0   155.0    71.0

In [170]:
# Remove rows with NA's

In [171]:
df= pd.DataFrame({"age":[19,20,np.nan,22,23,25,23],"Height":[165,163,170,np.nan,175,150,155],"weight":[70,65,66,np.nan,65,70,71]})
df

    age  Height  weight
0  19.0   165.0    70.0
1  20.0   163.0    65.0
2   NaN   170.0    66.0
3  22.0     NaN     NaN
4  23.0   175.0    65.0
5  25.0   150.0    70.0
6  23.0   155.0    71.0

In [172]:
df.dropna() # Drop rows with NA

    age  Height  weight
0  19.0   165.0    70.0
1  20.0   163.0    65.0
4  23.0   175.0    65.0
5  25.0   150.0    70.0
6  23.0   155.0    71.0

In [173]:
# Remove row which contains all NA's

In [174]:
# Create a dataframe
df= pd.DataFrame({"age":[19,20,np.nan,22,23,25,23],"Height":[165,163,np.nan,np.nan,175,150,155],"weight":[70,65,np.nan,np.nan,65,70,71]})
df

    age  Height  weight
0  19.0   165.0    70.0
1  20.0   163.0    65.0
2   NaN     NaN     NaN
3  22.0     NaN     NaN
4  23.0   175.0    65.0
5  25.0   150.0    70.0
6  23.0   155.0    71.0

In [175]:
df.dropna(how="all") # Drop the rows containing all NA's

    age  Height  weight
0  19.0   165.0    70.0
1  20.0   163.0    65.0
3  22.0     NaN     NaN
4  23.0   175.0    65.0
5  25.0   150.0    70.0
6  23.0   155.0    71.0

In [176]:
# Remove the columns containing NA's

In [177]:
df= pd.DataFrame({"age":[19,20,24,22,23,25,23],"Height":[165,163,np.nan,np.nan,175,150,155],"weight":[70,65,75,67,65,70,71]})
df

   age  Height  weight
0   19   165.0      70
1   20   163.0      65
2   24     NaN      75
3   22     NaN      67
4   23   175.0      65
5   25   150.0      70
6   23   155.0      71

In [178]:
df.dropna(axis=1) # drop columns with NA's

   age  weight
0   19      70
1   20      65
2   24      75
3   22      67
4   23      65
5   25      70
6   23      71

In [179]:
# <---------->

In [180]:
# groupby()

'''
Pandas dataframe.groupby() function is used to split the data into groups based on some criteria. pandas objects can be split on any of their axes. The abstract definition of grouping is to provide a mapping of labels to group names.
'''

'\nPandas dataframe.groupby() function is used to split the data into groups based on some criteria. pandas objects can be split on any of their axes. The abstract definition of grouping is to provide a mapping of labels to group names.\n'

In [181]:
# Create a dataframe

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [182]:
# Group by a single column(Attribute).

In [183]:
df.groupby(by='Team').groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [184]:
# Group by multiple columns(Attributes)

In [185]:
df.groupby(by=['Team','Year']).groups

{('Devils', 2014): Int64Index([2], dtype='int64'),
 ('Devils', 2015): Int64Index([3], dtype='int64'),
 ('Kings', 2014): Int64Index([4], dtype='int64'),
 ('Kings', 2016): Int64Index([6], dtype='int64'),
 ('Kings', 2017): Int64Index([7], dtype='int64'),
 ('Riders', 2014): Int64Index([0], dtype='int64'),
 ('Riders', 2015): Int64Index([1], dtype='int64'),
 ('Riders', 2016): Int64Index([8], dtype='int64'),
 ('Riders', 2017): Int64Index([11], dtype='int64'),
 ('Royals', 2014): Int64Index([9], dtype='int64'),
 ('Royals', 2015): Int64Index([10], dtype='int64'),
 ('kings', 2015): Int64Index([5], dtype='int64')}

In [186]:
'''Iterating through Groups
With the groupby object in hand, we can iterate through the object similar to itertools.obj.'''

'Iterating through Groups\nWith the groupby object in hand, we can iterate through the object similar to itertools.obj.'

In [187]:
grouped=df.groupby('Year')
grouped

In [188]:
for i in grouped:
    print(i)

(2014,      Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701)
(2015,       Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804)
(2016,      Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694)
(2017,       Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690)

In [189]:
# Select a Group

'''
Using the get_group() method, we can select a single group.
'''

'\nUsing the get_group() method, we can select a single group.\n'

In [190]:
grouped = df.groupby('Year')
grouped.get_group(2014) # We have selected year=2014 from year group.

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

In [191]:
# Aggregations

'''
An aggregated function returns a single aggregated value for each group. Once the group by object is created, several aggregation operations can be performed on the grouped data.
'''

'\nAn aggregated function returns a single aggregated value for each group. Once the group by object is created, several aggregation operations can be performed on the grouped data.\n'

In [192]:
grouped=df.groupby('Year')
grouped.agg(np.mean) # Calculate mean w.r.t to year (calculate mean for all numeric column)

      Rank  Points
Year
2014   2.5  795.25
2015   2.5  769.50
2016   1.5  725.00
2017   1.5  739.00

In [193]:
grouped=df.groupby('Year')
grouped['Points'].agg(np.mean) # Mean point w.r.t to year

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [194]:
grouped=df.groupby('Team')
grouped['Points'].agg([np.mean,np.median,np.std])

              mean  median         std
Team
Devils  768.000000   768.0  134.350288
Kings   761.666667   756.0   24.006943
Riders  762.250000   741.5   88.567771
Royals  752.500000   752.5   72.831998
kings   812.000000   812.0         NaN

In [195]:
# Transformations

'''
Transformation on a group or a column returns an object that is indexed the same size of that is being grouped. Thus, the transform should return a result that is the same size as that of a group chunk.
'''

'\nTransformation on a group or a column returns an object that is indexed the same size of that is being grouped. Thus, the transform should return a result that is the same size as that of a group chunk.\n'

In [196]:
score=lambda x: (x-np.mean(x))
grouped.transform(score)

        Rank      Year      Points
0  -0.750000 -1.500000  113.750000
1   0.250000 -0.500000   26.750000
2  -0.500000 -0.500000   95.000000
3   0.500000  0.500000  -95.000000
4   1.333333 -1.666667  -20.666667
5   0.000000  0.000000    0.000000
6  -0.666667  0.333333   -5.666667
7  -0.666667  1.333333   26.333333
8   0.250000  0.500000  -68.250000
9   1.500000 -0.500000  -51.500000
10 -1.500000  0.500000   51.500000
11  0.250000  1.500000  -72.250000

In [197]:
# Filteration

'''
Filtration filters the data on a defined criteria and returns the subset of data. The filter() function is used to filter the data.
'''

'\nFiltration filters the data on a defined criteria and returns the subset of data. The filter() function is used to filter the data.\n'

In [198]:
df.groupby('Team').groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [199]:
df.groupby('Team').filter(lambda  x: len(x)>=3) # Filters those teams having

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

In [200]:
# <---------->

In [201]:
# Merging\Joining

In [202]:
'''
Pandas has full-featured, high performance in-memory join operations idiomatically very similar to relational databases like SQL.
Pandas provides a single function, merge, as the entry point for all standard database join operations between DataFrame objects
'''

'\nPandas has full-featured, high performance in-memory join operations idiomatically very similar to relational databases like SQL.\nPandas provides a single function, merge, as the entry point for all standard database join operations between DataFrame objects\n'

In [203]:
#Create 2 dataframes

left = pd.DataFrame({'id':[1,2,3,4,5],'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame({'id':[1,2,3,4,5],'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],'subject_id':['sub2','sub4','sub3','sub6','sub5']})

print(left)
print('\n')
print(right)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [204]:
pd.merge(left,right,on='subject_id') # We have merged two dataframes by taking subject_id as reference.

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     3   Allen       sub4     2  Brian
2     4   Alice       sub6     4  Bryce
3     5  Ayoung       sub5     5  Betty

In [206]:
# variance of a dataframe

In [207]:
df= pd.DataFrame({"age":[19,20,24,22,23,25,23],"Height":[165,163,np.nan,np.nan,175,150,155],"weight":[70,65,75,67,65,70,71]})
df

   age  Height  weight
0   19   165.0      70
1   20   163.0      65
2   24     NaN      75
3   22     NaN      67
4   23   175.0      65
5   25   150.0      70
6   23   155.0      71

In [208]:
print(df.var(ddof=0))

age        3.918367
Height    74.240000
weight    11.142857
dtype: float64

In [209]:
print(df.var(ddof=1))

age        4.571429
Height    92.800000
weight    13.000000
dtype: float64